rikkapro0128/system_node_esp32_iot/src/main.cpp
// => EEPROM
EepromMiru eeprom(300, "esp8266-device-db-default-rtdb.firebaseio.com");

// => SERVER
AsyncWebServer server(80);

// => FIREBASE
FirebaseData fbdoStream;
FirebaseData fbdoControl;
FirebaseData createNode;

FirebaseAuth auth;
FirebaseConfig config;

// WIFI MODE - AP
String mode_ap_ssid = "esp32-miru";
String mode_ap_pass = "44448888";
String mode_ap_ip = "192.168.1.120";
String mode_ap_gateway = "192.168.1.1";
String mode_ap_subnet = "255.255.255.0";
String pathFile = "/";

// WIFI MODE - STATION

void setup()
{
  GEN_ID_BY_MAC.replace(":", "");
  ID_DEVICE = String("device-" + GEN_ID_BY_MAC);

#ifdef _DEBUG_
  Serial.begin(115200);
#endif
#ifdef _RELEASE_
  Serial.begin(115200);
#endif

#ifdef _DEBUG_
  Serial.println("");
  Serial.println("[---PROGRAM START---]");
#endif

  configTime(0, 0, ntpServer);
  eeprom.begin();

#ifdef _DEBUG_
  viewEEPROM();
#endif

  WiFi.hostname(CHost);
  WiFi.mode(WIFI_AP_STA);
  WiFi.persistent(true);
  WiFi.softAP(mode_ap_ssid.c_str(), mode_ap_pass.c_str());

#ifdef _DEBUG_
  IPAddress IP = WiFi.softAPIP();
  Serial.print("AP IP address: ");
#endif

  setupWifiModeStation();

  while (WiFi.status() != WL_CONNECTED)
  {
    if (timeoutWifi > 12)
    {
      WiFi.disconnect(true);
      break;
    }
    timeoutWifi++;
    delay(500);
  }

  setupWebserverModeAP();

  config.database_url = eeprom.databaseUrl;
  config.signer.test_mode = true;
#ifdef ESP8266
  fbdoStream.setBSSLBufferSize(1024 /* Rx in bytes, 512 - 16384 */, 1024 /* Tx in bytes, 512 - 16384 */);
#endif
  Firebase.begin(&config, &auth);
  Firebase.reconnectWiFi(true);
  checkFirebaseInit();
}

void loop()
{
  // #ifdef _RELEASE_
  // if (Serial.available() > 0)
  // {
  //   signal = (int)Serial.parseInt();
  //   if (signal > 0 && blockControl == false)
  //   {
  //     control = signal % 2 == 0 ? false : true;
  //     if (signal < 3)
  //     {
  //       idControl = 1;
  //     }
  //     else if (signal < 5)
  //     {
  //       idControl = 2;
  //     }
  //     else if (signal < 7)
  //     {
  //       idControl = 3;
  //     }
  //     if (millis() - timeDebounceLocalControl > 1000)
  //     {
  //       timeDebounceLocalControl = millis();
  //       if (WiFi.status() == WL_CONNECTED)
  //       {
  //         controllDevice(idControl, control, true, true);
  //       }
  //       else
  //       {
  //         controllDevice(idControl, control, false, true);
  //       }
  //     }
  //   }
  // }
  // #endif
  if ((millis() - sendDataPrevMillis > 2500 || sendDataPrevMillis == 0))
  {
#ifdef _DEBUG_
    checkRam();
#endif
    sendDataPrevMillis = millis();
    if (timerStack[0][1] != NULL && timeControll)
    {
#ifdef _DEBUG_
      PrintListTimer();
#endif
      epochTime = Get_Epoch_Time();
      bool expire = timerStack[0][1] > epochTime && timerStack[0][1] != NULL ? false : true;
      if (expire)
      {
        unsigned long rangeTimer = epochTime - timerStack[0][1];
        if (rangeTimer < 4)
        {
#ifdef _RELEASE_
          bool state = timerStack[0][2] == 1 ? true : timerStack[0][2] == 2           ? false
                                                  : stateDevice[timerStack[0][0] - 1] ? false
                                                                                      : true;
          controllDevice(timerStack[0][0], state, true);
#endif
        }
#ifdef _DEBUG_
        Serial.printf("Controll timer = %d\n", timerStack[0][1]);
        Serial.printf("[Epoch Time] = %d", rangeTimer);
#endif
        removeTimer(timerStack, indexTimerStack, indexTimerStack[0]);
        if (timerStack[0][1] == NULL)
        {
          timeControll = false;
        }
      }
    }
  }
  if (startRemovePath)
  {
#ifdef _DEBUG_
    Serial.println("--- Start remove ---");
#endif
    clearBufferFirebaseDataAll();
    if (ramHeapSize() > SSL_HANDSHAKE_REQUIRE)
    {
      if (Firebase.RTDB.deleteNode(&fbdoStream, removeAfter))
      {
#ifdef _DEBUG_
        Serial.println("--- Remove Doned ---");
#endif
        // setupStreamFirebase();
        removeAfter = "";
        startRemovePath = false;
      }
      else
      {
#ifdef _DEBUG_
        Serial.println("--- Can Not Remove ---");
#endif
      }
    }
    else
    {
#ifdef _DEBUG_
      Serial.println("--- Ram Not Enouge to SSL ---");
#endif
    }
  }
  if (reLinkApp && !startRemovePath)
  {
    clearBufferFirebaseDataAll();
#ifdef _DEBUG_
    Serial.println("--- Start Init New Firebase Stream ---");
#endif
    checkFirebaseInit();
    if (!fbdoStream.isStream())
    {
#ifdef _DEBUG_
      Serial.println("--- Restart Init New Firebase Stream ---");
#endif
      setupStreamFirebase();
    }
    reLinkApp = false;
  }
  if (resetConfig)
  {
    clearBufferFirebaseDataAll();
    Firebase.RTDB.deleteNode(&fbdoStream, removeAfter);
    resetConfig = false;
  }
}

#ifdef _DEBUG_
void viewEEPROM()
{
  String ssid = eeprom.readSSID();
  String password = eeprom.readPassword();
  String url = eeprom.readDatabaseUrl();
  String nodeID = eeprom.readNodeID();
  String userID = eeprom.readUserID();
  String dbNode = eeprom.DATABASE_NODE;
  String urlNode = eeprom.readDatabaseUrlNode();

  Serial.println("WIFI NAME = " + ssid + " | length = " + String(ssid.length()));
  Serial.println("WIFI PASS = " + password + " | length = " + String(password.length()));
  Serial.println("WIFI DATATBASE URL = " + url + " | length = " + String(url.length()));
  Serial.println("STATE URL = " + String(eeprom.canAccess));
  Serial.println("WIFI DATATBASE URL - NODE = " + dbNode + " | length = " + String(dbNode.length()));
  Serial.println("WIFI NODE ID = " + nodeID + " | length = " + String(nodeID.length()));
  Serial.println("WIFI USER ID = " + userID + " | length = " + String(userID.length()));
}
#endif

void setupStreamFirebase()
{
  Firebase.RTDB.setStreamCallback(&fbdoStream, streamCallback, streamTimeoutCallback);

  if (!Firebase.RTDB.beginStream(&fbdoStream, eeprom.DATABASE_NODE + "/devices"))
  {
#ifdef _DEBUG_
    Serial_Printf("stream begin error, %s\n\n", fbdoStream.errorReason().c_str());
#endif
  }
  else
  {
#ifdef _DEBUG_
    Serial.println(String("Stream OK!"));
#endif
  }
}

void streamCallback(FirebaseStream data)
{
#ifdef _DEBUG_
  Serial.println(ESP.getFreeHeap());
  Serial_Printf("sream path, %s\nevent path, %s\ndata type, %s\nevent type, %s\n\n",
                data.streamPath().c_str(),
                data.dataPath().c_str(),
                data.dataType().c_str(),
                data.eventType().c_str());
  Serial.println();
  Serial_Printf("Received stream payload size: %d (Max. %d)\n\n", data.payloadLength(), data.maxPayloadLength());
#endif
  String dataPath = data.dataPath();
  uint8_t dataType = data.dataTypeEnum();
  uint8_t numDevice = (uint8_t)(dataPath.substring(21, 22).toInt());
  if (dataType == d_boolean)
  {
    if (dataPath.indexOf("state") > 0 || numDevice) // execute controll turn on device by [INDEX]
    {
      if (data.dataTypeEnum() == fb_esp_rtdb_data_type_boolean)
      {
        bool state = data.to<boolean>();
        if (!blockControl)
        {
          controllDevice(numDevice, state);
        }
      }
    }
  }
  else if (dataType == d_json)
  {
    if (dataPath.equals("/") && isFirst)
    { // execute init state all device
#ifdef _DEBUG_
      Serial.println("Init Status");
#endif
      parserTimerJson(data, 1);
      parserTimerJson(data, 2);
      parserTimerJson(data, 3);

      sortTimer(timerStack, indexTimerStack);

